{
  "feedback" : "I recently started using Cotiss for my procurement needs and I have been extremely impressed. The tools are simple and intuitive, making it easy for even the most tech-phobic individual to use. The best part is that it doesn't have the enterprise price tag, so it's accessible for organizations of all sizes. Cotiss has truly changed the way my organization finds and wins new business, and I highly recommend it to anyone in need of a better procurement solution.",
  "feedback" : "I recently started using Cotiss for my company's procurement needs and I have been blown away by the simplicity and effectiveness of their tools. The user interface is intuitive and easy to use, which has made the whole process of sourcing and purchasing goods and services much more streamlined for our team.\n\nOne of the standout features of Cotiss is their focus on social procurement and supporting diverse, local suppliers. This aligns with our company values and has helped us to make more responsible purchasing decisions that benefit our community.\n\nAnother thing I love about Cotiss is their commitment to making best practice procurement accessible to organisations of all sizes. Their pricing is competitive and they offer a range of services that are tailored to our specific needs.\n\nOverall, I highly recommend Cotiss to any organisation looking to improve their procurement processes and make a positive impact in their community. They are truly changing the game in the procurement space.",
  "feedback" : "As a Karen, I must say that I am extremely disappointed in Cotiss. The platform is not user-friendly at all and I had a lot of difficulty navigating it. The customisation options were limited and didn't meet my needs. I also found the focus on sustainability and supporting diverse businesses to be off-putting. I prefer to stick with the traditional procurement methods and will not be using Cotiss again.",
  "feedback" : "Cotiss is great. It's easy to use and has a lot of customization options. Highly recommend.",
  "feedback" : "I recently came across Cotiss and was immediately disappointed. The platform is clunky and outdated, with limited customization options. I much prefer my own product/service, which is superior in every way. It offers a more user-friendly interface, a wider range of customization options, and better value for money. Don't waste your time with Cotiss, go with my product/service instead.",
  


}